.config/doom/config.org
#+TITLE: Harsh Vyapari's Doom Emacs Configuration
#+AUTHOR: Harsh Vyapari (harshv5094)
#+EMAIL: harshv5094@gmail.com
#+DATE: <2024-06-05 Wed>
#+DESCRIPTION: My personal doom emacs configuration file, inspired from distrotube's configuration
#+STARTUP: showeverything

* Table of Contents :toc:
- [[#about-this-config][About This Config]]
- [[#basic-necessary-configuration][Basic Necessary Configuration]]
  - [[#relative-line-numbers][Relative Line Numbers]]
  - [[#custom-doom-emacs-theme][Custom Doom Emacs Theme]]
  - [[#default-font-for-doom-emacs][Default font for DOOM Emacs]]
  - [[#doom-modeline][Doom Modeline]]
  - [[#setting-default-org-location][Setting Default org location]]
- [[#beacon][Beacon]]
- [[#bookmarks][Bookmarks]]
  - [[#default-bookmarks-path][Default bookmarks path]]
- [[#clippy][Clippy]]
- [[#custom-banner][Custom Banner]]
- [[#dired][Dired]]
  - [[#keybindings-to-open-dired][Keybindings to open Dired]]
  - [[#keybindings-within-dired][Keybindings within Dired]]
  - [[#keybindings-within-dired-with-peep-dired-mode-enabled][Keybindings Within Dired With Peep-Dired-Mode Enabled]]
- [[#emojis][Emojis]]
- [[#changing-local-leader-key][Changing Local Leader Key]]
- [[#insert-date][Insert Date]]
- [[#mouse-support][Mouse Support]]
- [[#minimap][Minimap]]
- [[#markdown][Markdown]]
  - [[#font-header-adjustment][Font Header Adjustment]]
- [[#neotree][Neotree]]
- [[#obsidian-plugin][Obsidian Plugin]]
  - [[#directory-setup][Directory Setup]]
  - [[#basic-keymaps-for-obsidianel][Basic Keymaps for =obsidian.el=]]
- [[#org-mode][ORG MODE]]
  - [[#org-agenda][Org Agenda]]
  - [[#org-fonts][Org Fonts]]
  - [[#org-journal][Org Journal]]
  - [[#org-roam][Org Roam]]
- [[#rainbow-mode][Rainbow Mode]]
- [[#terminal-shells][Terminal Shells]]

* About This Config
By using distrotube's basic structure, I've added my own spin in my configuration.

* Basic Necessary Configuration
This are the necessary configuration that I need in my config

** Relative Line Numbers
Here we are setting relative line number as we setup in vim
#+begin_src emacs-lisp
(setq display-line-numbers-type 'relative)
#+end_src

** Custom Doom Emacs Theme
Here we are setting custom doom emacs theme for your setup
#+begin_src emacs-lisp
(setq doom-theme 'doom-one)
#+end_src

** Default font for DOOM Emacs
Changing the default font of DOOM Emacs
- doom-font’ – standard monospace font that is used for most things in Emacs.
- ‘doom-variable-pitch-font’ – variable font which is useful in some Emacs plugins.
- ‘doom-big-font’ – used in doom-big-font-mode; useful for presentations.
- ‘font-lock-comment-face’ – for comments.
- ‘font-lock-keyword-face’ – for keywords with special significance like ‘setq’ in elisp.

#+begin_src emacs-lisp
(setq doom-font (font-spec :family "JetBrainsMono Nerd Font" :size 15 :weight 'bold)
      doom-big-font (font-spec :family "JetBrainsMono Nerd Font" :size 16 :weight 'extra-bold)
      doom-variable-pitch-font (font-spec :family "JetBrainsMono Nerd Font" :size 15 :weight 'bold :slant 'italic))
(after! doom-themes
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t))
(custom-set-faces!
  '(font-lock-comment-face :slant italic)
  '(font-lock-keyword-face :slant italic))
#+end_src

** Doom Modeline
The modeline is the bottom status bar that appears in Emacs windows.
For more information on what is available to configure in the Doom modeline, check out: https://github.com/seagle0128/dooom-modeline
#+begin_src emacs-lisp
(setq doom-modeline-height 30                   ;; sets modeline height
      doom-modeline-env-load-string "..."       ;; sets modeline loading string
      doom-modeline-bar-width 5)                ;; sets right bar width
#+end_src

** Setting Default org location
If you are using org and you don't want your files in the default location below,
change `org-directory`. It must be set before org loads!
#+begin_src emacs-lisp
(setq org-directory "~/org/")
#+end_src

* Beacon
Never loose your cursor. When you scroll, yourr cursor will shine! This is a global mirror. Turn it on everywhere with:
#+begin_src emacs-lisp
(beacon-mode 1)
#+end_src

* Bookmarks

** Default bookmarks path
We are setting default bookmarks path for the file
#+begin_src emacs-lisp
(setq bookmark-default-file "~/.config/doom/bookmarks")
#+end_src

* Clippy
Gives us a popup box with "Clippy, the paper clip". You can make him say various thing by calling =clippy-say= function.
But the more useful functions are the two describe functions provided: =clippy-describe-function= and =clippy-describe-variable=.
Hit the appropriate keybindings while the point is over a function/variable to call it.
A popup with helpful clippy will appear, telling you about the function/variable (using describe-function and describe-variable rescpectively).

| COMMAND                  | DESCRIPTION                           | KEYBINDING |
|--------------------------+---------------------------------------+------------|
| clippy-describe-function | /Clippy describes function under point/ | SPC c h f  |
| clippy-describe-variable | /Clippy describes variable under point/ | SPC c h v  |


#+begin_src emacs-lisp
(map! :leader
      (:prefix ("c h" . "Help info from Clippy")
       :desc "Clippy describes function under point" "f" #'clippy-describe-function
       :desc "Clippy describe variable under point" "v" #'clippy-describe-variable))
#+end_src

* Custom Banner
To change into custom banner just change `fancy-splash-image`:
#+begin_src emacs-lisp
(setq fancy-splash-image "~/.config/doom/banner/doom-emacs-dash.png")
#+end_src

* Dired
Dired is the file manager within Emacs. Below, I setup keybindings for image previews (peep-dired). Doom Emacs does not use =SPC d= for any of its keybindings, So I've chosen the format of =SPC d + `key`=.

** Keybindings to open Dired

| COMMAND    | DESCRIPTION                        | KEYBINDING |
|------------+------------------------------------+------------|
| dired      | /Open dired file manager/            | SPC d d    |
| dired-jump | /Jump to current directory in dired/ | SPC d j    |


#+begin_src emacs-lisp
(map! :leader
      (:prefix ("d". "dired")
       :desc "Open Dired" "d" #'dired
       :desc "Dired Jump To Current Directory" "j" #'dired-jump)
      (:after dired
        (:map dired-mode-map
         :desc "Peep-dired image previews" "d p" #'peep-dired
         :desc "Dired view file" "d v" #'dired-view-file)))
#+end_src

** Keybindings within Dired

*** Basic Dired Commands

| COMMAND                 | DESCRIPTION                                 | KEYBINDING |
|-------------------------+---------------------------------------------+------------|
| dired-view-file         | /View file in dired/                          | SPC d v    |
| dired-up-directory      | /Go up in directory tree/                     | h          |
| dired-find-file         | /Go down in directory tree (or open if file)/ | l          |
| dired-next-line         | /Move down to next line/                      | j          |
| dired-previous-line     | /Move up to previous line/                    | k          |
| dired-mark              | /Mark file at point/                          | m          |
| dired-unmark            | /Unmark file at point/                        | u          |
| dired-do-copy           | /Copy current file or marked files/           | C          |
| dired-do-rename         | /Rename current file or marked files/         | R          |
| dired-hide-details      | /Toggle detailed listings on/off/             | (          |
| dired-git-info-mode     | /Toggle git information on/off/               | )          |
| dired-create-directory  | /Create new empty directory/                  | +          |
| dired-create-empty-file | /Creates new empty file/                      | N          |
| dired-diff              | /Compare file at point with another/          | =          |
| dired-subtree-toggle    | /Toggle viewing subtree at point/             | TAB        |

*** Dired Commands using regex

| COMMAND                 | DESCRIPTION                | KEYBINDING |
|-------------------------+----------------------------+------------|
| dired-mark-files-regexp | /Mark files using regex/     | % m        |
| dired-do-copy-regexp    | /Copy files using regex/     | % C        |
| dired-do-rename-regexp  | /Rename files using regex/   | % R        |
| dired-mark-files-regexp | /Mark all files using regex/ | * %        |

*** File Permissions and Ownership

| COMMAND         | DESCRIPTION                      | KEYBINDING |
|-----------------+----------------------------------+------------|
| dired-do-chgrp  | /Change the group of marked files/ | g G        |
| dired-do-chmod  | /Change the mode of marked files/  | M          |
| dired-do-chown  | /Change the owner of marked files/ | O          |
| dired-do-rename | /Rename file or all marked files/  | R          |

#+begin_src emacs-lisp
(evil-define-key 'normal dired-mode-map
  (kbd "M-RET") 'dired-display-file
  (kbd "h") 'dired-up-directory
  (kbd "l") 'dired-open-file ; use dired-find-file instead of dired-open.
  (kbd "m") 'dired-mark
  (kbd "t") 'dired-toggle-marks
  (kbd "u") 'dired-unmark
  (kbd "C") 'dired-do-copy
  (kbd "D") 'dired-do-delete
  (kbd "J") 'dired-goto-file
  (kbd "M") 'dired-do-chmod
  (kbd "O") 'dired-do-chown
  (kbd "P") 'dired-do-print
  (kbd "R") 'dired-do-rename
  (kbd "T") 'dired-do-touch
  (kbd "Y") 'dired-copy-filenamecopy-filename-as-kill ; copies filename to kill ring.
  (kbd "Z") 'dired-do-compress
  (kbd "+") 'dired-create-directory
  (kbd "N") 'dired-create-empty-file
  (kbd "-") 'dired-do-kill-lines
  (kbd "% l") 'dired-downcase
  (kbd "% m") 'dired-mark-files-regexp
  (kbd "% u") 'dired-upcase
  (kbd "* %") 'dired-mark-files-regexp
  (kbd "* .") 'dired-mark-extension
  (kbd "* /") 'dired-mark-directories
  (kbd "; d") 'epa-dired-do-decrypt
  (kbd "; e") 'epa-dired-do-encrypt)
;; Get file icons in dired
(add-hook 'dired-mode-hook 'all-the-icons-dired-mode)
;; With dired-open plugin, you can launch external programs for certain extensions
;; For example, I set all .png files to open in 'sxiv' and all .mp4 files to open in 'mpv'
(setq dired-open-extensions '(("gif" . "sxiv")
                              ("jpg" . "sxiv")
                              ("png" . "sxiv")
                              ("mkv" . "mpv")
                              ("mp4" . "mpv")))
#+end_src

** Keybindings Within Dired With Peep-Dired-Mode Enabled
If peep-dired is enabled, you will get image previews as you go up/down with 'j' and 'k'

| COMMAND              | DESCRIPTION                              | KEYBINDING |
|----------------------+------------------------------------------+------------|
| peep-dired           | /Toggle previews within dired/             | SPC p d    |
| peep-dired-next-file | /Move to next file in peep-dired-mode/     | j          |
| peep-dired-prev-file | /Move to previous file in peep-dired-mode/ | k          |

#+begin_src emacs-lisp
(evil-define-key 'normal peep-dired-mode-map
  (kbd "j") 'peep-dired-next-file
  (kbd "k") 'peep-dired-prev-file)
(add-hook 'peep-dired-hook 'evil-normalize-keymaps)
#+end_src

* Emojis
Emojify is an Emacs extensions to display emojis. It can display github style emojis like :smile: or plain ascii ones like :)
#+begin_src emacs-lisp
(use-package emojify
  :hook (after-init . global-emojify-mode))
#+end_src

* Changing Local Leader Key
Here we are setting local leader key
#+begin_src emacs-lisp
(setq doom-localleader-key "\\")
#+end_src

* Insert Date
ome custom functions to insert the date.  The function ‘insert-todays-date’ can be used one of three different ways: (1) just the keybinding without the universal argument prefix, (2) with one universal argument prefix, or (3) with two universal argument prefixes.  The universal argument prefix is ‘SPC-u’ in Doom Emacs (C-u in standard GNU Emacs).  The function ‘insert-any-date’ only outputs to one format, which is the same format as ‘insert-todays-date’ without a prefix.

* Mouse Support
Adding mouse support in the terminal version of the emacs
#+begin_src emacs-lisp
(xterm-mouse-mode 1)
#+end_src

