.config/doom/config.org
* Minimap
A minimap sidebar displaying a smaller version of the current buffer on either the left or right side.
It highlights the currently shown region and updates its position automatically.
Be aware this minimap program does not work in Org documents.

| COMMAND      | DESCRIPTION                               | KEYBINDING |
|--------------+-------------------------------------------+------------|
| minimap-mode | /Toggle minimap-mode/                       | SPC t m    |


#+begin_src emacs-lisp
(setq minimap-window-location 'right)
(map! :leader
      (:prefix ("t" . "toggle")
       :desc "Toggle minimap-mode" "m" #'minimap-mode))
#+end_src

* Markdown

** Font Header Adjustment
Here we are adjusting the font size for markdown
#+begin_src emacs-lisp
(defun hv/markdown-colors-doom-one ()
  "Enable Doom One colors for Markdown headers."
  (interactive)
  (require 'markdown-mode) ; Ensure Markdown mode is loaded
  (dolist
      (face
       '((markdown-header-face-1 1.6 "#51afef" ultra-bold)
         (markdown-header-face-2 1.5 "#c678dd" extra-bold)
         (markdown-header-face-3 1.4 "#98be65" bold)
         (markdown-header-face-4 1.3 "#da8548" semi-bold)
         (markdown-header-face-5 1.2 "#5699af" normal)
         (markdown-header-face-6 1.1 "#a9a1e1" normal)))
    (set-face-attribute (nth 0 face) nil :font doom-variable-pitch-font :weight (nth 3 face) :height (nth 1 face) :foreground (nth 2 face))))

(hv/markdown-colors-doom-one)
#+end_src


* Neotree
Neotree is a file viewer. When you open neotree, it jumps to the current file thanks to neo-smart-open.
The neo-window-fixed-size setting makes the neotree width be adjustable. Doom Emacs had no keybinding set for neotree.
Since Doom Emacs uses `SPC t` for `toggle` keybindings, I used `SPC t n` for toggle-neotree.

| COMMAND        | DESCRIPTION               | KEYBINDING |
|----------------+---------------------------+------------|
| neotree-toggle | /Toggle neotree/            | SPC t n    |
| neotree- dir   | /Open directory in neotree/ | SPC d n    |

#+begin_src emacs-lisp
(after! neotree
  (setq neo-smart-open t
        neo-window-fixed-size nil))
(after! doom-themes
  (setq doom-neotree-enable-variable-pitch t))
(map! :leader
      :desc "Toggle neotree file viewer" "t n" #'neotree-toggle
      :desc "Open directory in neotree" "d n" #'neotree-dir)
#+end_src

* Obsidian Plugin
I'm setting up =obsidian.el= plugin in my emacs so I can use obsidian within emacs

** Directory Setup
#+begin_src emacs-lisp
(use-package obsidian
  :ensure t
  :demand t
  :config
  (obsidian-specify-path "~/Documents/Notebook")
  )
#+end_src

** Basic Keymaps for =obsidian.el=

Since there is no keybindings associated with =SPC O=, I'm using it for my obsidian keybindings

| COMMANDS                 | DESCRIPTION                       | KEYBINDINGS |
|--------------------------+-----------------------------------+-------------|
| obsidian-insert-link     | /Insert Markdown Link In Obsidian/  | SPC O l     |
| obsidian-insert-wikilink | /Insert a link in wikilink format/  | SPC O w     |
| obsidian-jump            | /Jump Between Notes/                | SPC O j     |
| obsidian-capture         | /Creating new notes/                | SPC O n     |
| obsidian-search          | /Searching notes in Obsidian Vault/ | SPC O s     |
| obsidian-tag-find        | /Finding all notes by tag/          | SPC O t     |
| obsidian-move-file       | /Move note to another folder/       | SPC O m     |

#+begin_src emacs-lisp
(map! :leader
      (:prefix ("O" . "Obsidian")
       :desc "obsidian-insert-link" "l" #'obsidian-insert-link
       :desc "obsidian-insert-wikilink" "w" #'obsidian-insert-wikilink
       :desc "obsidian-jump" "j" #'obsidian-jump
       :desc "obsidian-capture" "n" #'obsidian-capture
       :desc "obsidian-search" "s" #'obsidian-search
       :desc "obsidian-tag-find" "t" #'obsidian-tag-find
       :desc "obsidian-move-file" "m" #'obsidian-move-file))
#+end_src


* ORG MODE
I'm wrapping most of this block in (after! org). Without this, my settings might be evaluated too early,
which will result in my settings being overwritten by Doom's defaults.
I have also enabled org-journal, org-superstar, and org-roam by adding (+journal +pretty +roam2) to the org section of my Doom Emacs
init.el

#+begin_src emacs-lisp
(map! :leader
      :desc "Org babel Tangle" "\\ B" #'org-babel-tangle)

(after! org
  (setq org-directory "~/org"
        org-default-notes-file (expand-file-name "notes.org" org-directory)
        org-ellipsis " ▼ "
        org-superstar-headline-bullets-list '("◉" "●" "○" "◆" "●" "○" "◆")
        org-superstar-itembullet-alist '((?+ . ?➤) (?- . ?✦)) ; changes +/- symbols in item lists
        org-log-done 'time
        org-hide-emphasis-markers t
        ;; ex. of org-link-abbrev-alist in action
        ;; [[arch-wiki:Name_of_Page][Description]]
        org-link-abbrev-alist  ;This overwrites the default Doom org-link-abbrev-list
        '(("google" . "https://www.google.com/search?q=")
          ("wiki" . "https://en.wikipedia.org/wiki/"))
        org-table-convert-region-max-lines 2000
        org-todo-keywords        ; This overwrites the default Doom org-todo-keywords
          '((sequence
             "TODO(t)"           ; A task that is ready to be tackled
             "BLOG(b)"           ; Blog writing assignments
             "GYM(g)"            ; Things to accomplish at the gym
             "PROJ(p)"           ; A project that contains other tasks
             "VIDEO(v)"          ; Video assignments
             "WAIT(w)"           ; Something is holding up this task
             "|"                 ; The pipe necessary to separate "active" states and "inactive" states
             "DONE(d)"           ; Task has been completed
             "CANCELLED"))))    ; Task has been cancelled
#+end_src

** Org Agenda
Setting org agenda drive
#+begin_src emacs-lisp
(after! org
  (setq org-agenda-files '("~/org/agenda.org")))

(setq
   org-fancy-priorities-list '("🟥" "🟧" "🟨")
   org-priority-faces
   '((?A :foreground "#ff6c6b" :weight bold)
     (?B :foreground "#98be65" :weight bold)
     (?C :foreground "#c678dd" :weight bold))
   org-agenda-block-separator 8411)

(setq org-agenda-custom-commands
      '(("v" "A better agenda view"
         ((tags "PRIORITY=\"A\""
                ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                 (org-agenda-overriding-header "High-priority unfinished tasks:")))
          (tags "PRIORITY=\"B\""
                ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                 (org-agenda-overriding-header "Medium-priority unfinished tasks:")))
          (tags "PRIORITY=\"C\""
                ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                 (org-agenda-overriding-header "Low-priority unfinished tasks:")))
          (tags "customtag"
                ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                 (org-agenda-overriding-header "Tasks marked with customtag:")))

          (agenda "")
          (alltodo "")))))
#+end_src

** Org Fonts
This emacs lisp code allow to set font size of org header
#+begin_src emacs-lisp
(defun hv/org-colors-doom-one ()
  "Enable Doom One colors for Org headers."
  (interactive)
  (require 'org) ; Ensure Org mode is loaded
  (dolist
      (face
       '((org-level-1 1.6 "#51afef" ultra-bold)
         (org-level-2 1.5 "#c678dd" extra-bold)
         (org-level-3 1.4 "#98be65" bold)
         (org-level-4 1.3 "#da8548" semi-bold)
         (org-level-5 1.2 "#5699af" normal)
         (org-level-6 1.1 "#a9a1e1" normal)
         (org-level-7 1.0 "#46d9ff" normal)
         (org-level-8 0.9 "#ff6c6b" normal)))
    (set-face-attribute (nth 0 face) nil :font doom-variable-pitch-font :weight (nth 3 face) :height (nth 1 face) :foreground (nth 2 face)))
    (set-face-attribute 'org-table nil :font doom-font :weight 'normal :height 1.0 :foreground "#bfafdf"))

(hv/org-colors-doom-one)
#+end_src

** Org Journal
#+begin_src emacs-lisp
(setq org-journal-dir "~/org/journal"
      org-journal-date-prefix "* "
      org-journal-time-prefix "** "
      org-journal-date-format "%B %d %Y (%A)"
      org-journal-file-format "%Y-%m-%d")
#+end_src

** Org Roam
[[https://github.com/org-roam/org-roam][Org-Roam]] is a plain-text Knowledge management system. Org-roam borrows principles from the =Zettelkasten= method, providing
a solution for non-hierarchical note-taking. It should also work as a plug-and-play solution for anyone already using
Org-Mode for their personal wiki.

| COMMAND                | DESCRIPTION                        | KEYBINDING |
|------------------------+------------------------------------+------------|
| completion at point    | /Completion of node-insert at point/ | SPC n r c  |
| org-roam-note-find     | /Find node or create a new one/      | SPC n r f  |
| org-roam-graph         | /Show graph of all nodes/            | SPC n r g  |
| org-roam-node-insert   | /Insert link to a node/              | SPC n r i  |
| org-roam-capture       | /Capture to node/                    | SPC n r n  |
| org-roam-buffer-toggle | /Toggle roam buffer/                 | SPC n r r  |

#+begin_src emacs-lisp
(after! org
  (setq org-roam-directory "~/Documents/Notebook/ORG"
        org-roam-graph-view "/usr/bin/firefox"))
(map! :leader
      (:prefix ("n". "Custom Maps")))

(map! :leader
      (:prefix ("n r". "org-roam")
       :desc "Completion at point" "c" #'completion-at-point
       :desc "Find node" "f" #'org-roam-node-find
       :desc "Show graph" "g" #'org-roam-graph
       :desc "Insert node" "i" #'org-roam-node-insert
       :desc "Capture to node" "n" #'org-roam-capture
       :desc "Toggle roam buffer" "r" #'org-roam-buffer-toggle))
#+end_src

#+RESULTS:
: org-roam-buffer-toggle

